Revit 2027 API
BuiltInFailures.GroupFailures.NoSwapGroupBeingEdited Property
 You may not change the type of the group that is currently being edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSwapGroupBeingEdited { get; }
Public Shared ReadOnly Property NoSwapGroupBeingEdited As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSwapGroupBeingEdited {
	FailureDefinitionId^ get ();
}
static member NoSwapGroupBeingEdited : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace